Revit 2024 API
Options.ComputeReferences Property
Determines whether or not references to geometric objects are computed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool ComputeReferences { get; set; }
Visual Basic
Public Property ComputeReferences As Boolean
	Get
	Set
Visual C++
public:
property bool ComputeReferences {
	bool get ();
	void set (bool value);
}
See Also
Options Class
Autodesk.Revit.DB Namespace